Revit 2027 API
CompoundStructure.GetSegmentOrientation Method
 Gets the orientation of a segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RectangularGridSegmentOrientation GetSegmentOrientation(
	int segmentId
)
Public Function GetSegmentOrientation (
	segmentId As Integer
) As RectangularGridSegmentOrientation
public:
RectangularGridSegmentOrientation GetSegmentOrientation(
	int segmentId
)
member GetSegmentOrientation :
        segmentId : int -> RectangularGridSegmentOrientation
Parameters
segmentId Int32
 The id of a segment in this CompoundStructure.
Return Value
RectangularGridSegmentOrientation
 The orientation of the specified segment.
Exceptions
Exception | Condition
ArgumentException |  The segment id is invalid.
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 The boundaries of the regions of a vertically compound structure consist of vertical horizontal segments.
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace